<<<<<<< HEAD
"""Задача 3. Переменные: Преобразования типов(мы этого не проходили, поэтому можешь загуглить как это делается)
Описание: Создайте переменную со строковым числом, преобразуйте её в целое число, прибавьте число и снова преобразуйте результат в строку."""


def changing_types(type, num):
    type = int(type)
    type += num
    print(str(type))
    return type


changing_types("35", 3)
=======
"""Задача 3. Переменные: Преобразования типов(мы этого не проходили, поэтому можешь загуглить как это делается)
Описание: Создайте переменную со строковым числом, преобразуйте её в целое число, прибавьте число и снова преобразуйте результат в строку."""


def changing_types(type, num):
    type = int(type)
    type += num
    print(str(type))
    return type


changing_types("35", 3)
>>>>>>> de8b46c386c5496f5f8adeb5ee10c13a723663b9
